/****************************************************************
题目描述：一只青蛙一次可以跳上1级台阶，也可以跳上2级……它也可以跳上n级。
求该青蛙跳上一个n级的台阶总共有多少种跳法。
解题思路：当跳n级台阶时，第一步可以跳1阶，或2阶，...，或n阶。那么最后的跳法就为:
          f(n) = 1 + f(n - 1) + f(n - 2) + ...+f(1)
		  f(1) = 1
		  f(2) = 2
		  f(3) = 1 + f(2) + f(1) = 1 + 3 = 4 = 2 ^(3 - 1)
		  f(4) = 1 + f(3) + f(2) + f(1) = 1 + 4 + 3 = 8 = 2 ^ (4 - 1)
		  ...
		  f(n) = 2 ^ (n - 1)
*******************************************************************/

class Solution {
public:
    int jumpFloorII(int number) {
        if(number <= 2)
            return number;
        int result;
        result = pow(2, number - 1);
        return result;
    }
};
