/*****************************************************************************************************
题目描述：圆圈中最后剩下的数， n个人，轮流报数到 m - 1,最后剩下一个人，求此人的编号。
解题思路：
1.当圆圈中剩下最后一个人时，他此时编号为0， 即 f(1) = 0;
2.当圆圈中剩下两个人时，最后活下来的人在这两个人里的编号 f(2) = f(1) + m;
3. 避免超出编号总长度要对当前的总人数取模，f(i) = [f(i-1) + m] % i
*******************************************************************************************************/

  class Solution {
public:
    int LastRemaining_Solution(int n, int m)
    {
        if(n < 1 || m < 1)
            return -1;
        int last = 0;  //当剩下一个人时，剩下的人现在的编号为0
        for(int i = 2; i <= n; ++i)
            last = (last + m) % i;
        return last;
    }
};