/************************************************************************************************************
题目描述
给定数组A[0,1,...,n-1],请构建一个数组B[0,1,...,n-1],其中B中的元素B[i]=A[0]*A[1]*...*A[i-1]*A[i+1]*...*A[n-1]。
不能使用除法。
解题思路：将B的计算分为两部分C[i]=A[0]*A[1]*...*A[i-1]和D[i]=A[i+1]*A[i+2]*...A[n-1]
1.C[0]=1, C[i] = C[i-1]*A[i-1]
2.D[n-1]=1,D[i]=D[i+1]*A[i+1]
3.B[i]=C[i]*D[i]
*************************************************************************************************************/
class Solution {
public:
    vector<int> multiply(const vector<int>& A) {
        vector<int> B;
        if(A.empty())
            return B;
        B.push_back(1); //B[0] = 1
        for(int i = 1; i < A.size(); ++i)
        {
            int Bi = B[i - 1] * A[i - 1];  //c[i] = c[i-1]*A[i-1]
            B.push_back(Bi);
        }
        int temp = 1;
        for(int j = A.size() - 2; j >= 0; --j)
        {
            temp = temp * A[j + 1];
            B[j] = B[j] * temp;
        }
        return B;
            
        
    }
};